<template>
  <div>
    <h1 class="title">ルービックキューブ世界記録4.90秒の凄さを一般人にも分かりやすく解説</h1>
    <p class="subtitle">記事投稿日 : 2017年6月19日<br />最終修正日 : 2022年11月21日</p>
    <p>
      ※この記事は、<a href="https://adventar.org/calendars/823" target="_blank">Speedcubing Advent Calendar 2015</a
      >の企画として執筆したものです。
    </p>
    <p>
      2015年11月21日に、アメリカのLucas
      Etterが、ルービックキューブの世界記録4.90秒をだし、ネットニュースでも多く取り上げられました。
    </p>
    <p>
      <a href="https://japan.techinsight.jp/2015/11/post-161152.html" target="_blank"
        >ルービックキューブ世界記録更新！4.90秒の神業</a
      ><br />
      <a href="https://gigazine.net/news/20151125-rubik-cube-world-record/" target="_blank"
        >わずか14歳の少年がルービックキューブの世界記録更新、5秒を切る神業を披露</a
      >
    </p>
    <p>
      上に挙げた2つの記事はとてもしっかり調査されており、世界記録の功績を正確に伝えていると思います。
      しかし当然のことながら、これらの記事を書いてる方達はルービックキューブについて専門家ではないので、「神業」以外の表現はできません。
    </p>
    <p>
      そこで、ルービックキューブ（特に速さを競うスピードキューブ）に一応詳しい立場として、今回の世界記録がいかに凄いものかを紹介したいと思います。
    </p>
    <p>4.90秒の世界記録の動画はこちら</p>
    <p><youtube-card id="vh0W8E4cNkQ"></youtube-card></p>
    <p>
      ※すでにスピードキューブについてある程度精通している方は、前半の解法に関する章については軽く読み飛ばして下さい。
    </p>

    <h2>ルービックキューブの解法 -概要-</h2>
    <h3>CFOP法</h3>
    <p>
      まずは、ルービックキューブの大会で、10秒前後で揃えるような人達が、どのような方法でルービックキューブを揃えているのかを説明します。
    </p>
    <p>ルービックキューブの早解きでは、現在99%の人が「CFOP法」という方法を使っています。CFOPとはそれぞれ</p>
    <ul>
      <li><b>C</b>ross</li>
      <li><b>F</b>2L（First 2 Layer ⇒ 最初の2層）</li>
      <li><b>O</b>LL（Orientatioin of the Last Layer ⇒ 最後の層の向き合わせ）</li>
      <li><b>P</b>LL（Permutation of the Last Layer ⇒ 最後の層の場所合わせ）</li>
    </ul>
    <p>の頭文字からとっており、この4ステップをすることで、ルービックキューブを効率よく揃えることができます。</p>
    <p>あまり詳しくは説明しませんが、</p>
    <h5>1. クロスを揃えて(Cross)</h5>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/cross.webp" width="80px" />
    </div>

    <h5>2. 下の2層を揃えて（First 2 Layer : F2L）</h5>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/f2l.webp" width="320px" />
    </div>
    <h5>3. 最後の層の向きを揃えて（Orientatioin of the Last Layer : OLL）</h5>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/oll.webp" width="160px" />
    </div>
    <h5>4. 最後の層の場所を揃える（Permutation of the Last Layer : PLL）</h5>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/pll.webp" width="160px" />
    </div>
    <p>この4ステップで、ルービックキューブが完成します。</p>

    <h3>Cross</h3>
    <p>
      最初のクロスですが、これはパターンを覚えるというよりは、経験数・練習数がものをいいます。うまくやれば、だいたい<b>5～8手</b>くらいで揃えることができます。
    </p>
    <p>
      ルービックキューブの公式競技では、タイムを計り始める前に最大15秒間のキューブを見て考える時間（インスペクションタイム）があるのですが、上級者はその時間で、このクロスを読み切ります。
    </p>
    <p>逆に言えば、それ以上は15秒では読めません。超上級者で次のF2Lのひとつ目まで読めればかなりすごいです。</p>

    <h3>F2L</h3>
    <p>
      次の「F2L」では、下の2段を揃えます。クロスを揃えた時点でそのクロスの周りに4つの「スロット」があるので、そこにひとつひとつ入れていきます。
      合計で4つのスロットがあり、ペアのパーツを入れていくので、それぞれを<b>1stペア</b>、<b>2ndペア</b>、<b>3rdペア</b>、<b>4thペア</b>と呼びます。
      1つのスロットを入れるので最短で<b>3手</b>、長いと<b>10手前後</b>かかります。
    </p>

    <h3>OLL</h3>
    <p>
      次は最後の層の向きを揃える「OLL」です。ルービックキューブがある程度早い人達（だいたい、20秒を切るあたり）は、
      最後の層の向きがバラバラの状態から、一気に向きを揃える（上面の色を揃える）パターンと、その手順を、すべて覚えています。そのパターンの数は、<b>57</b>です。
    </p>
    <p>
      参考 : Cube Voyage
      <a href="https://cubevoyage.net/how-to-solve/advanced/oll-algorithm/" target="_blank">OLL基本57手順</a> 一覧表より
      <div class="columns ml-0 mr-0">
        <img src="@/assets/37/oll-580x379.webp" />
      </div>
    </p>
    <p>
      これをすべて覚えて、瞬時にどのパターンか判断し、手順を回すというのは、なかなか大変です。しかし、ルービックキューブを競技として本気でやるのであれば、いずれ通らなければならない道です。
    </p>

    <h3>PLL</h3>
    <p>最後の層の場所を揃える「PLL」では、そのパターン数は<b>21</b>あります。</p>
    <p>
      参考 : roudai.net
      <a href="https://roudai.net/pll/pll-view/" target="_blank">PLL一覧</a> より
      <div class="columns ml-0 mr-0">
        <img src="@/assets/37/pll-326x580.webp" />
      </div>
    </p>
    <p>
      OLLより少ないですが、その分OLLよりもひとつひとつの手順の手数（回す数）が多くなるため、これをすべて覚えるのもOLLと同じくらい大変です。
    </p>
    <p>
      このOLL、PLLをすべて覚え、瞬時に回せるようになって、やっとルービックキューブ上級者の「入り口」に立つことができます。
    </p>

    <h2>世界記録のそのとき、何が起きたのか。</h2>
    <p>
      ここで、世界記録の解法を見てみましょう。ルービックキューブの解法は、このように記号で一意に表すことができます。
    </p>
    <div class="box">
      スクランブル<br />
      R2 B D2 F2 U2 R D2 L' B L' B D R' F' U B2 F L<br />

      解法<br />
      z2 // インスペクション<br />
      D' L' R' F R D2' // クロス<br />
      U2 L' U' L // 1stペア<br />
      U' U' U' F' U' F U R U' R' // 2ndペア<br />
      y R U R' // 3rdペア<br />
      U' y U' U' R U R' // 4thペア<br />
      U r U r' R U R' U' r U' r' // OLL
    </div>
    <p>
      D、Lといった記号は<b>回転記号</b>といい、記号ひとつにつき1回転（90度回転、D2等の場合は180度回転）を表します。詳しくはCube
      Voyageの
      <a href="https://cubevoyage.net/how-to-solve/intermediate/notation/" target="_blank">用語解説 : 回転記号とは？</a>
      に投げることとして、ここでは説明しません。記号ひとつにつき1回転、とだけ思って下さい。
    </p>
    <p>
      スクランブルとは、ルービックキューブの崩し手順のことをさします。公式大会では、このようにプログラムで出力した崩し手順に従って初期状態を決めて、タイムを測定します。
    </p>
    <p>
      解法では、無駄な動きも含めて合計<b>40手</b>（解法的には36手）かかっているため、tps（turns per second :
      1秒あたりの回転数）は<b>8.16</b>となります。
    </p>
    <p>解法をもとに回してみた動画がこちら。</p>
    <p><youtube-card id="cJLuPVJPLNk"></youtube-card></p>

    <h3>インスペクション</h3>
    <p>
      解法の最初の1行、インスペクションにある"z2"はキューブの持ち替え記号で、上下逆に持つことを表します。
      ルービックキューブの公式ルールでは白色の面が上の状態を基準とするため、白面を下にして開始したことを表します。
      これは最初にキューブを見るとき（インスペクション時）に決めるため、タイムには影響しません。
    </p>

    <h3>Cross</h3>
    <p>クロスは、6手で終わっています。特別なことはしておらず、ごく普通の手法です。</p>

    <h3>F2L</h3>
    <p>
      1stペア～4thペアをしているのが分かると思います。各ペア手順の最初のほうにあるUやyの記号は上面の位置合わせや持ち替えを表しているので、
      実際にF2Lをやっているのはそれ以降になります。つまりF2L手順としては、
    </p>
    <div class="box">
      L' U' L // 1stペア<br />
      F' U' F U R U' R' // 2ndペア<br />
      R U R' // 3rdペア<br />
      R U R' // 4thペア<br />
    </div>
    <p>となります。</p>
    <p>
      この中で2ndペアでは少しテクニカルな方法を用いていますが、1st、3rd、4thのペアはすべて3手で終わっており、これはF2Lの中で最も短い手数です。
      3rd、4thまで読んで2ndペアでテクニカルなことをしたのかは不明ですが、この時点でかなりの幸運であったことは間違いありません。
    </p>

    <h3>OLL</h3>
    <p>
      次に、OLLです。そして、解法は何故かOLLで終わっており、PLLが書かれていません。これは、OLLが終わった時点でPLLがすでにない状態になり、
      完成してしまったことを表します（これをPLLスキップと呼びます）。PLLをするだけでもどれだけ早い人でも1秒前後かかるため、このPLLスキップが起きたために好タイムがでました。
    </p>
    <p>
      ルービックキューブの、特に単発での記録ではやはりこういった「運」の要素が非常に大きく、単発の世界記録、日本記録等の多くの記録は、
      このように途中や最後のステップがなかったことによるラッキーで更新されることがほとんどです。
    </p>

    <h3>OLL</h3>
    <p>
      次に、OLLです。そして、解法は何故かOLLで終わっており、PLLが書かれていません。
      これは、OLLが終わった時点でPLLがすでにない状態になり、完成してしまったことを表します（これをPLLスキップと呼びます）。
      PLLをするだけでもどれだけ早い人でも1秒前後かかるため、このPLLスキップが起きたために好タイムがでました。
    </p>
    <p>
      ルービックキューブの、特に単発での記録ではやはりこういった「運」の要素が非常に大きく、
      単発の世界記録、日本記録等の多くの記録は、このように途中や最後のステップがなかったことによるラッキーで更新されることがほとんどです。
    </p>

    <h2>ラッキーでは済まされない、超高等テクニック</h2>
    <p>
      ここまで読むと、「なんだ、ただラッキーなだけで世界記録更新したんじゃん」と思うことでしょう。しかしその裏には、想像を超える超高等テクニックが使われています。
    </p>

    <h3>超高等テクニック : OLLCP</h3>
    <p>
      OLLとは、「最後の層の向きを揃える」というステップでした。しかし近年では、このOLLをさらに発展させた、「<b>OLLCP</b>」というものが開発されています。
    </p>
    <p>
      OLLCPとは、<b>O</b>rientation of <b>L</b>ast <b>L</b>ayer and <b>C</b>orner <b>P</b>ermutation
      のことで、その字面通り、「最後の層の向きを合わせかつ、コーナーの場所を揃える(Corner Permutation)」ことをいいます。
    </p>
    <p>
      OLLは全部で57パターンあると紹介しましたが、OLLCPはこのOLLをさらに細分化して、全部で<b>331</b>パターンあります。
    </p>
    <p>例えば、</p>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/OLL16.webp" width="80px" />
    </div>
    <p>このようなパターンのOLLがあるのですが、これがOLLCPになると</p>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/ollcp.webp" width="240px" />
    </div>
    <p>さらに6つに細分化されます。向きだけではなく、コーナーの色まで見て判断する必要があります。</p>
    <p>
      見ての通り、OLLCPの判断はとても難しく、また300以上というパターン数は、想像を絶する数です。
      OLLCPという考え自体が提案されたのが2011年頃とかなり新しい手法なこともあり、このパターンをすべて覚え、実践している人が世界にいるのかは不明です。
      しかし、トップレベルの選手達は、少しずつではありながら、着実にこれを使いこなしつつあります。
    </p>
    <p>そんな膨大なパターン数と、激ムズな判断をしてまで、OLLCPを使おうとするのはなぜでしょうか？</p>
    <p>
      その一番の理由は、<br />
      <b>PLLスキップの確率が格段に上がる </b><br />
      ことです。
    </p>
    <p>
      タイムがどんどん縮まっている現在、ただ運任せにラッキーなスキップを待つよりも、可能な限り<b>意図的にラッキーを作り出そう</b>としているのです。
    </p>
    <p>
      普通にOLLをした場合、PLLスキップする確率は<b>1/72</b>、<b>約1.4%</b>です（PLLは21パターンですが、対称性などを考慮するとこの確率になります）。
    </p>
    <p>
      それが、OLLCPを使うことで、PLLスキップの確率は<b>1/12</b>、<b>約8.3%</b>と、<b>6倍</b>にも跳ね上がります。
      トップレベルの選手たちは、こうやって少しでもラッキーなケースを引き当てようとしています。
    </p>

    <h3>前世界記録との比較</h3>
    <p>Lucas Etterがだした4.90秒の前の世界記録は、Collin Burnsがだした5.25秒でした。</p>
    <p>動画はこちら</p>
    <p><youtube-card id="i8RBl7NmL8g"></youtube-card></p>
    <p>
      実はこのときのCollinの記録も、今回のLucasと全く同じで、OLLCPをしてPLLスキップが起きたことででた記録でした（OLLCPの効果を世界に知らしめたきっかけでもあります）。
    </p>
    <p>しかし、二つの動画を見比べてみると、一点決定的な違いがあります。それが何か分かりますか？</p>
    <p>それは、それぞれがキューブが完成した瞬間を見ることで、分かります。</p>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/collin.webp" />
    </div>

    <p>
      Collinの動画では、OLLが終わった瞬間からタイマーを止める（手元のタイマーに手を置く）までに、一瞬の間があります。
      上の画像を見ると、キューブが完成した瞬間では4.8秒台を示しています。つまり、キューブが完成してから、PLLスキップが起きたことを確認し、
      タイマーを止めるまでに、<b>約0.3秒</b>のタイムラグがあります。これが、通常のPLLスキップが偶然起きたときの動きです。
    </p>
    <div class="columns ml-0 mr-0">
      <img src="@/assets/37/lucas.webp" />
    </div>
    <p>
      それが、Lucasのほうを見てみると、キューブが完成した瞬間にはすでにキューブから手を離し、手元のタイマーを止めにいっています。
      もしCollinと同じように動きを止めていれば、世界記録は更新されていなかったでしょう。なぜLucasはこのようなことができたのでしょうか？
    </p>

    <h3>Last Layerの最終形態 : 1LLL</h3>
    <p>
      それは、LucasがOLLCPをしながらも、さらにPLLスキップが起こることまで読み切っていたからとしか考えられません。
      最後の層を一気に揃える、つまりOLLとPLLを同時にすることを、<b>1LLL(1 Look Last Layer)</b>と呼びます。
    </p>
    <p>
      もちろんそのパターン数はOLLCPと比べ物にならないほど多く、対称なものや逆回しのものを同一とみた場合でも<b>1211</b>パターン、
      それらを別のもとした場合<b>3915</b>パターンにもなります。もちろん、これをすべて使いこなす人はまだ誰もいません
      （コンピュータを使って手順の解析、洗い出しはされています）。
    </p>
    <p>
      Lucasは、OLLCPをしながらも、その形のその手順が1LLLであることを（偶然）知っていた、と思われます。
      もちろんすべてのパターンを知っているわけではありませんが、何千回何万回と練習をしている中で、それが分かったのでしょう。
    </p>
    <p>
      5.25秒と4.90秒の差はわずか0.35秒ですが、その0.35秒を縮めるためにはこれほどまでの高等な技術が要求されるのです。
    </p>

    <h2>まとめ</h2>
    <h3>世界記録4.90秒の凄さを一言でいうと</h3>
    <p>Lucas Etterがだした世界記録4.90秒がいかに凄いか、これまでの解説をもとに一言で言うと、</p>
    <p><b>1秒あたり8回転以上の速さでキューブを回しながら、4000近いパターンの中から1つを瞬時に判断し、完成させた</b></p>
    <p>ということになります。凄い。</p>

    <h3>まだまだ発展途上のスピードキューブ</h3>
    <p>
      発売されて35年、世界キューブ協会が発足し大会が行われるようになってから10年以上たちましたが、いまだルービックキューブの早さを競うスピードキューブは発展途上といえます。
      現に、ルービックキューブの大会では全部で18もの競技があるのですが、そのほとんどが2014年以降、つまりこの2年以内に更新されたものです。
    </p>
    <p>
      ここで紹介したOLLCPのように、CFOP法のステップをさらに発展させたものをサブステップと呼ぶのですが、
      OLLCP以外にも、COLL、2GLL、ZBLL、VHF2L、OLSといった様々なサブステップが今でも考案され、研究されています。
    </p>
    <p>
      また、ハードの面でも、いまだに毎月のように新しい競技用キューブが開発され、各メーカーがより良いキューブを目指して競っています。
    </p>

    <h3>世界記録はどこまで伸びるのか？</h3>
    <p>
      今後10年破られない世界記録がいつ出るのか、それはまだ誰にも分かりません。しかし、4.90秒はまだまだその域には達していないと考えます。
    </p>
    <p>
      ここ数年単発世界記録にこそ恵まれないものの、平均記録では圧倒的実力を持ち、公式大会で10回以上も5秒台をだしているFeliks
      Zemdegsは、 その指の速さもさながら、自由度の高い突飛のないソルブをすることがあります。
    </p>
    <div class="column is-8 is-offset-2">
      <blockquote class="twitter-tweet">
        <a href="https://twitter.com/naka_jima_yu/status/651378030795845632?ref_src=twsrc%5Etfw"></a>
      </blockquote>
    </div>
    <p>
      例えば次の動画では、途中でLLがスキップすることに気づき、そこまでリバースしてやり直して完成させています（4.55秒を出しておいてベスト記録逃したよ！とうなだれている様子）
    </p>
    <p><youtube-card id="luVhnfFy5-g"></youtube-card></p>
    <p>
      また、平均で6.65秒をだした時の4回目のソルブでは、日本のトップレベルの選手をもってしても「謎の技術」と呼ばれる解き方をして、話題になりました。
      （下記動画53秒から）
    </p>
    <p>
      海外の掲示板でも、LSLL(Last slot Last Layer)と呼ばれ、クレイジーだと評されています。<br />
      <a href="https://www.speedsolving.com/threads/feliks-zemdegs-6-65-3x3x3-average.51683/" target="_blank"
        >[Official] Feliks Zemdegs - 6.65 3x3x3 average</a
      >
    </p>
    <p><youtube-card id="QqZvylORy0I"></youtube-card></p>
    <p>
      このように、ルービックキューブの早解きにはまだまだ研究の余地が残されています。
      きっと近い将来、4秒前半、さらには3秒台の記録を出すような人が、現れるのではないでしょうか。
    </p>
    <p>
      <b>
        2022年追記 : その後2018年に、中国のYusheng Du
        (杜宇生）が3.47秒を記録し、その後も3秒台の記録はいくつかでています。
      </b>
    </p>
  </div>
</template>

<script>
export default {
  head() {
    return {
      script: [
        {
          type: 'text/javascript',
          async: true,
          src: 'https://platform.twitter.com/widgets.js',
        },
      ],
    }
  },
  mounted() {
    window.twttr.widgets.load()
  },
}
</script>

<style scoped>
img {
  max-width: 100%;
}
</style>
