<template>
  <div>
    <h1 class="title">ルービックキューブ世界記録をMats Valkが4.74秒に更新！詳細解説</h1>
    <p class="subtitle">記事投稿日 : 2016年12月14日<br />最終修正日 : 2022年11月21日</p>
    <p>
      2016年11月6日、インドネシアで行われたJawa Timur Open 2016にて、オランダ人のMats
      Valkがルービックキューブの世界記録を<b>4.74秒</b>に更新しました。
    </p>
    <p>これまでの世界記録は2015年11月21日にLucas Etterがだした4.90秒で、約1年ぶりの更新になります。</p>
    <p>この記録については、下記の記事で詳細に解説しています。</p>
    <p>
      <a href="http://blog.roudai.net/post-37/">ルービックキューブ世界記録4.90秒の凄さを一般人にも分かりやすく解説</a>
    </p>
    <p>ここでは、今回の世界記録について、色々と解説して行きたいと思います。</p>
    <p>
      ルービックキューブの基本的な解法については上記の記事に書いているので、読んでいない方はまずそちらを読んでみて下さい。
    </p>
    <p>この記事では前記事を前提として、少し専門的な解説をします。</p>
    <p>4.74秒の世界記録の動画はこちら</p>
    <p><youtube-card id="tLksISrKtO8"></youtube-card></p>

    <h2>そもそもMats Valkとは？</h2>
    <p>今回世界記録を出したMats Valkとは、どのような人物なのでしょうか。</p>
    <p>実は彼は、2013年3月にも当時の世界記録、5.55秒をだしたことがあります。当時の動画がこちら。</p>
    <p><youtube-card id="FBDiQr_LWLY"></youtube-card></p>
    <p>
      この記録は2015年4月にCollin
      Burnsが5.25秒をだすまで、約2年もの間更新されなかったため、彼はかなり長い間世界トップに君臨していたことになります。そして今回、1年8ヵ月ぶりの世界記録奪回となりました。
    </p>
    <p>
      個人的には、2013年にラスベガス現地で見た世界大会決勝で、Feliks
      Zemdegsと繰り広げた優勝争いの興奮は、今でも忘れられません（結果はFeliksが優勝、Matsが2位）。
    </p>

    <h2>世界記録4.74秒の解法</h2>
    <p>
      それでは早速、今回の世界記録について見ていきたいと思います。
      最初に書きましたが、ルービックキューブの基本的な解法については<a href="http://blog.roudai.net/post-37/#i"
        >前回の記事</a
      >を参考にして下さい。
    </p>
    <div class="box">
      スクランブル<br />
      B2 F2 D F2 L2 U R2 B2 F2 U2 L2 B' L2 R2 D' U2 L2 U' R' F R<br /><br />

      解法<br />
      インスペクション: x' y'<br />
      クロス: L' D R2<br />
      F2L-1: R U' R' U' L' U' L<br />
      F2L-2: U2 R U R' U' d' R U R'<br />
      F2L-3: y U2 R U' R' L U' L'<br />
      F2L-4: y' U2 R' U2 R U2<br />
      VLS: R' U R' F R F' U R<br />
      AUF: U
    </div>
    <p>手数は前回のLucasと同じ40手で、tps（turns per second : 1秒あたりの回転数）は8.44となります。</p>
    <h3>インスペクション・クロス</h3>
    <p>
      今回Matsは、緑色をクロス面に選んでいます。これにより、クロスがわずか3手で終わっています。
      クロス色を固定する場合、白か黄色を選ぶ人が多いのですが、Matsは基本は青クロス、ときどき緑クロスを使うという世界的にも珍しい競技者です。
    </p>
    <h3>F2L</h3>
    <p>
      基本通り、F2Lを1～4まで4回行っています。しかしここで不思議なのは、普通であればF2L-4でF2Lがすべて終わるはずが、まだ4つ目のスロットが埋まっていない状態になっています。（1枚目がMatsがF2L-4を終えた状態。2枚目はそれを時計回りに90度回したもの。）
    </p>
    <p>
      このあと<b>"VLS"</b>という聞き慣れないステップを踏んで、最後にAUF（Adjust U Face :
      上面の位置合わせ）をして完成させています。
    </p>
    <p>このVLSというのはいったいなんなのでしょう。</p>

    <h2>Mats Valkの代名詞、Valk Last Slot(VLS)</h2>
    <p>
      Matsが解法の中で使っているVLSとは、Valk Last Slotの略です。Valkという名前がついている通り、Mats
      Valk本人が提唱しているテクニックで、彼はその開発者でありながら、世界一の使い手でもあります。
    </p>
    <p>
      VLSとはどのようなものかというと、<br />
      <b>「最後のF2Lを入れる時に、強制的にOLLをスキップさせる手順」</b><br />
      になります。
    </p>
    <p>このVLSについて語るには、このテクニックが世界で広まるまでのちょっとした歴史をたどらないといけません。</p>
    <p>参考：<a href="https://www.speedsolving.com/wiki/index.php/VLS" target="_blank">Speedcubing.com VLS</a></p>
    <p>VLSの元となったのは、2005年にLucas Winterが提案した<b>Winter Variation(WV)</b>というテクニックでした。</p>
    <p>
      Winter Variationの手順については、私が管理しているルービックキューブ情報サイト、roudai.netでも記載しています。
    </p>
    <p><a href="https://roudai.net/f2l/winter-variation/" target="_blank">roudai.net - Winter Variation</a></p>
    <p>
      Winter Variationは、<br />
      「最後のF2Lを入れるとき、<b>かつ上面のエッジ向きがすべて正しいときに</b>、OLLをスキップさせる手順」<br />
      のことをいいます。
    </p>
    <p>
      VLSは、このWinter
      Variationから「上面のエッジ向きがすべて正しいとき」という条件を除いて、「上面のエッジ向きにかかわらず」OLLをスキップさせる手順です。
    </p>
    <p>
      Winter Variationは全部で<b>27パターン</b>ですが、Valk Last SlotではWinter
      Variationを含む全<b>216</b>までパターン数が増えます。
    </p>
    <p>
      MatsはこのVLSを2009年あたりから公式大会でも使い始め、試技の動画が公開されると頻繁にOLLをスキップしているため話題になりましたが、彼はこの手順を秘匿し、しばらく公開していませんでした。
    </p>
    <p>
      その数年後、2013年になって、アメリカのRowe
      HesslerがVLSと同じようにOLLをスキップさせる手順をすべてまとめて公開しました。それを見たMats
      Valkは観念したのか、Roweに連絡を取り、協力して改めて手順をまとめあげ、それを公開しました。
    </p>
    <p>
      これが今からほんの3年ほど前の話だということを考えると、ルービックキューブの理論・テクニックがいかにまだ発展途上で、今なお進化し続けているかがよく分かると思います。
    </p>
    <p>
      ちなみにこのVLSは手順数の多さもあり、これを使いこなせているのは現状世界でもMatsくらいしかいないのではないかと思います。
    </p>

    <h2>最新キューブ、Cubicle Valk M</h2>
    <p>
      今回の世界記録を語る中で、もうひとつ欠かせない点があります。それが、ハードウェア面です。 Mats
      Valkは現在、中国のルービックキューブメーカーであるQiYi（チーイー）とスポンサー契約を結んでおり、QiYiよりMats
      Valkプロデュースモデル、「Valk 3」が発売されています。
    </p>
    <p>
      <a href="https://store.tribox.com/products/detail.php?product_id=1857" target="_blank">
        QiYi Valk 3 (チーイィ ヴォーク スリー)</a
      >
    </p>
    <p>
      そして今回の世界記録で用いたのは、さらに最新モデルとなる「Cubicle Valk
      M」（Mats自身はValk3Mと呼んでいる）というものだったようです。
    </p>
    <p>
      Cubicle Valk Mはアメリカのパズル販売サイト、<a href="https://www.thecubicle.com/" target="_blank">TheCubicle</a
      >が現行のValk3に手を加えて販売しているもののようで、値段もかなり高め（49ドル、約5000円）です。
    </p>
    <p>このCubicle Valk Mは、Valk3の内部にマグネットを仕込んだもので、より回転を制御しやすくしたものだそうです。</p>
    <p>
      最近他のパズル（ピラミンクス、スキューブ等）でもこのようにマグネットを組み込んだ商品がちょっとしたブームになっているため、その流れを汲んだものだと思われます。マグネットを仕込んで動きを変えるというのは少しズルい気もしますが、公式大会での使用も今のところ認められています。
    </p>
    <p>
      MatsのFacebookによると、彼はこの最新キューブを11月3日に受け取ったばかりだったようで、今回いきなりそのキューブで世界記録をだして、スポンサー的には宣伝効果大というわけです。
    </p>
    <p>
      先日のアジア大会でValk4の発売も発表されており、ここ最近トップキューバーの間でおきているValkブランドキューブブームが、もっと加速しそうです。
    </p>

    <h2>まとめ</h2>
    <p>
      今回のMats
      Valkの記録は、F2Lの4スロット目をVLSすることで強制的にOLLをスキップし、それがさらにPLLスキップしたことによりでた記録でした（この一文の意味がもし理解できれば、スピードキューブに関する知識は十分ついています）。
    </p>
    <p>
      前回の記事でいかに「意図的にラッキーを作るか」の話をしましたが、今回の記録もまさに意図的に作り出したラッキーにより出したものであると言えます。
    </p>
    <p>
      さらには、VLSという新しいテクニックを自ら編み出し、それを極めたうえで出した世界記録には、とても価値があります（実は2013年の5.55秒も、今回と全く同じVLS+PLLスキップででたものです）
      おそらく今回のスクランブルで、Matsと同じ解き方が瞬時にできる人はMats本人以外にはいないと思います。
    </p>
    <p>これからどんなテクニックが生まれ、さらに記録が更新されていくのか、とても楽しみです。</p>
  </div>
</template>
