<template>
  <div>
    <h1 class="title">7000円のルービックキューブはなんでそんなに高いのか</h1>
    <p class="subtitle">記事投稿日 : 2019年1月8日<br />最終修正日 : 2022年11月21日</p>
    <p>
      2019年になり、立体パズル専門店triboxで新年の福袋（1万円）を購入したのですが、そ
      の中に、こんなルービックキューブが入ってました。
    </p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-1.webp" />
      </figure>
    </div>
    <p>
      なんだかとっても冬っぽいパッケージ。中国製です。このパズル、下記が販売ページなのですが、販売価格がなんと6900円。
      めっちゃ高い。自分はそんなにハードウェアにこだわりがないほうなので、自分の意志ではこの値段はちょっと買いません。
    </p>
    <p>
      <a href="https://store.tribox.com/products/detail.php?product_id=2528">GAN356 X Numerical IPG Stickerless</a>
    </p>
    <p>
      おもちゃ屋や本屋で買える日本の正規品のルービックキューブが、定価2200円です。
      競技用のルービックキューブでも、安いものなら500円くらいから売っているものもあり、
      初級～中級であればこれくらいの価格帯のもので正直十分な性能があったりします。
    </p>
    <p>じゃあこの高級キューブはなんでこんなに高いのか？それをちょっと解説してみたいと思います。</p>

    <h2>このルービックキューブでできること</h2>
    <p>まず最初に、このルービックキューブは普通に売っているものや初心者向けのものと何が違うのか、その概要です。</p>
    <p>このキューブには、下の写真のような付属品がついています。</p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-2.webp" />
      </figure>
    </div>
    <p>これらを使ってできることは、</p>
    <ol>
      <li>磁力の調整</li>
      <li>バネの強さの調整</li>
      <li>バネの締め付け具合の調整</li>
    </ol>
    <p>の3つです。</p>

    <h2>磁力の調整</h2>
    <p>
      ルービックキューブに磁力と言われてもなんのことかさっぱりかと思いますが、最近の競技用ルービックキューブでは、
      動きの補助として中に磁石が仕込まれています。これによって、回しすぎの防止や、動きが安定したりします。
    </p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-3.webp" />
      </figure>
    </div>
    <p>キューブの一部をとり外した状態です。取り外した部分が、磁石によってくっついています。</p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-4.webp" />
      </figure>
    </div>
    <p>横から見るとこんな感じ。丸いのが磁石です。</p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-5.webp" />
      </figure>
    </div>
    <p>
      この磁石の部分に、写真のように棒を差し込むことで、ロケット鉛筆のような要領で部品を入れ替えることができます
      （撮影のためパーツを外していますが、実際は分解することなく交換が可能です）。
      1枚目の写真の、棒状のものがその磁石のパーツです。棒の両先端に色によって磁力の違う磁石が埋め込まれており、
      元から入っているものを含めて3種類＋磁力無しの中から選択することができます。
    </p>
    <p>昔は自分で接着剤で磁石をつけたりしていたのですが、誰でも簡単に磁石の入れ替えができるようになっています。</p>
    <h2>バネの強さの調整</h2>
    <p>次に、バネの強さの調整です。ルービックキューブは、各面の真ん中がバネで固定されています。</p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-6.webp" />
      </figure>
    </div>
    <p>
      このバネが、元から入ってるものを含め4色用意されています。これは色によってそれぞれバネの強さ（反発力）が違います。
    </p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-7.webp" />
      </figure>
    </div>
    <p>
      バネの強さによってルービックキューブの回し心地、回すときの硬さが変わるため、好みによって調整することができます。
    </p>

    <h2>バネの締め付け具合の調整</h2>
    <p>
      先ほどはバネの強さの話でしたが、回し心地はもちろんその締め付け具合でも変わってきます。
      先ほどの写真のセンター部分をよく見てみると、数字（0.6、0.8、1.0）が書かれています。
      これはその締め付け具合を数値化していて、それぞれの数字のところに引っ掛けることで、それを調整することができます。
    </p>
    <div class="column is-8 is-offset-2">
      <figure class="image">
        <img src="@/assets/700/700-8.webp" />
      </figure>
    </div>
    <p>
      バネの締め付けといったら、普通はプラスドライバーでネジを締めたりしますよね。
      これまでのルービックキューブもそうだったのですが、それでは各面の締め付け具合が微妙に変わってしまって、調整が大変でした。
      それをこの製品では、数値化することで各面が常に同じ締め付け具合になるように工夫がされています。
    </p>

    <h2>まとめ</h2>
    <p>これらをまとめると、この7000円のルービックキューブは、</p>
    <ol>
      <li>磁力の調整 ⇒ 4種類</li>
      <li>バネの強さの調整 ⇒ 4種類</li>
      <li>バネの締め付け具合の調整 ⇒ 3種類</li>
    </ol>
    <p>
      でそれぞれ調整することができ、組み合わせると4x4x3=48パターンから自分の好みの回し具合を選択することができます。
    </p>
    <p>
      競技としてルービックキューブをやるためには1秒、0.1秒を追い求めるようになるので、こういったこだわりが必要になってくるんですね。
    </p>
    <p>
      7000円のルービックキューブ、高いと思いますか？僕はせっかく手に入れたので、来月の大会までに少しずつ調整を楽しんでいきたいと思います。
    </p>
  </div>
</template>

<style>
figure {
  width: 580px;
  height: 435px;
}
</style>
